app/controllers/streets_controller.rb

SELECT * FROM "streets"
---
  def index
    @streets = Street.all

INSERT INTO "streets" ("name", "price", "modules", "created_at", "available", "updated_at") VALUES('Borbollón Sur', 1075.5, 50, '2010-04-07 03:29:59', 50, '2010-04-07 03:29:59')
---
  def create
    street = Street.new(params[:street])
    if street.save